Tekla Open API Reference for Tekla Structures 2025
AnalysisRigidDiaphragm Methods
The AnalysisRigidDiaphragm type exposes the following members.
Methods
Name | Description
Select
 Selects an analysis rigid diaphragm. The ID has to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisRigidDiaphragm Class
Tekla.Structures.Analysis Namespace